from fastapi import APIRouter

router = APIRouter(prefix="/mock/abs", tags=["Мок АБС"])


@router.get("/counterparties")
async def mock_abs_counterparties():
    """Мок-эндпоинт который притворяется АБС.
    В реальности тут будет URL реальной АБС
    Джоба синхронизации дёргает именно этот эндпоинт"""
    return [
        {
            "inn": "7728168971",
            "kpp": "770801001",
            "full_name": "ООО «Ромашка»",
            "short_name": "Ромашка",
            "address": "г. Москва, ул. Ленина, 1",
            "phone": "+7 (495) 123-45-67",
        },
        {
            "inn": "5010056539",
            "kpp": "501001001",
            "full_name": "АО «Технологии будущего»",
            "short_name": "ТехБудущего",
            "address": "г. Москва, ул. Тверская, 10",
            "phone": "+7 (495) 987-65-43",
        },
        {
            "inn": "7707083893",
            "kpp": "770701001",
            "full_name": "ПАО «Сбербанк России»",
            "short_name": "Сбербанк",
            "address": "г. Москва, ул. Вавилова, 19",
            "phone": "+7 (495) 500-55-50",
        },
        {
            "inn": "7736050003",
            "kpp": "773601001",
            "full_name": "ООО «Газпром Нефть»",
            "short_name": "ГазпромНефть",
            "address": "г. Москва, Намёткина, 16",
            "phone": "+7 (495) 777-77-77",
        },
        {
            "inn": "7825706086",
            "kpp": "782501001",
            "full_name": "ООО «Северсталь»",
            "short_name": "Северсталь",
            "address": "г. Санкт-Петербург, Мира, 30",
            "phone": "+7 (812) 333-33-33",
        },
    ]